In [2]:
import pandas as pd
import numpy as np
import ast

In [2]:
#reading credits.csv
df=pd.read_csv(r"C:\Users\Utsav.lakhlani\Desktop\Training\Capstone Project 3\Capstone Project 3\Data\credits.csv")

# splitting the credits dataframe into cast and crew dataframes

In [3]:
# Convert the string representation of dictionaries back to a list of dictionaries
df['cast'] = df['cast'].apply(ast.literal_eval)

In [4]:
#createing different data frame and converting them into csv
cast=[]
for index,l1 in df.iterrows():
    movid=l1['id']
    for dic in l1['cast']:
        dic['mov_id']=movid
        cast.append(dic)
cast=pd.DataFrame(cast)

In [ ]:
cast.to_csv('cast.csv', index=False)

In [7]:
# Convert the string representation of dictionaries back to a list of dictionaries
df['crew'] = df['crew'].apply(ast.literal_eval)

In [8]:
#similarly for crew in the same dataframe
crew=[]
for index,l1 in df.iterrows():
    movid=l1['id']
    for dic in l1['crew']:
        dic['mov_id']=movid
        crew.append(dic)
crew=pd.DataFrame(crew)

In [ ]:
cast.to_csv('cast.csv', index=False)

# making collections dataframe from movie metadata

In [3]:
#reading movies_metadata.csv
meta=pd.read_csv(r'C:\Users\sambangi.bindu\Downloads\Capstone Project 3\Capstone Project 3\Data\movies_metadata.csv')

C:\Users\sambangi.bindu\AppData\Local\Temp\ipykernel_20584\1600292365.py:2: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  meta=pd.read_csv(r'C:\Users\sambangi.bindu\Downloads\Capstone Project 3\Capstone Project 3\Data\movies_metadata.csv')

In [4]:
import copy
tempmeta=copy.deepcopy(meta[meta['belongs_to_collection'].isnull()==False])

In [5]:
# Convert the string representation of dictionaries back to a list of dictionaries
tempmeta['belongs_to_collection'] = tempmeta['belongs_to_collection'].apply(ast.literal_eval)

In [6]:
series=[]
for index,l1 in tempmeta.iterrows():
    movi=l1['id']
    if type(l1['belongs_to_collection']) is dict:
        l1['belongs_to_collection']['mov_id'] = movi
        series.append(l1['belongs_to_collection'])
series=pd.DataFrame(series)

In [7]:
series[series.duplicated()]

,id,name,poster_path,backdrop_path,mov_id
3817,158365,Why We Fight,/fFYBLu2Hnx27CWLOMd425ExDkgK.jpg,None,159849
4441,34055,Pokémon Collection,/j5te0YNZAMXDBnsqTUDKIBEt8iu.jpg,/iGoYKA0TFfgSoZpG2u5viTJMGfK.jpg,10991
4445,34055,Pokémon Collection,/j5te0YNZAMXDBnsqTUDKIBEt8iu.jpg,/iGoYKA0TFfgSoZpG2u5viTJMGfK.jpg,12600

In [8]:
series.drop_duplicates(inplace=True)

In [9]:
series.shape

(4488, 5)

In [10]:
series.isnull().sum()

id                  0
name                0
poster_path       543
backdrop_path    1227
mov_id              0
dtype: int64

In [11]:
series.dtypes

id                int64
name             object
poster_path      object
backdrop_path    object
mov_id           object
dtype: object

In [12]:
series['mov_id']=series['mov_id'].astype(int)

In [13]:
series.dtypes

id                int64
name             object
poster_path      object
backdrop_path    object
mov_id            int32
dtype: object

In [14]:
series['name'].str.isspace().value_counts()

False    4488
Name: name, dtype: int64

In [21]:
series.to_csv('collection.csv',index=False)

# production companies dataframe

In [61]:
#for production companies

tempProd=copy.deepcopy(new_meta[new_meta['production_companies'].isnull()==False])

In [62]:
a=[]
for index,l1 in tempProd.iterrows():

    movid=l1['Mov_id']

    for dic in l1['production_companies']:
        if isinstance(dic,dict):
            dic['movie_id']=movid
        else:
            pass
        a.append(dic)
production_companies=pd.DataFrame(a)

Data cleaning of production_companies

In [4]:
production_companies.head()

                        name     id  movie_id
0    Pixar Animation Studios      3       862
1           TriStar Pictures    559      8844
2               Teitler Film   2550      8844
3  Interscope Communications  10201      8844
4               Warner Bros.   6194     15602

In [5]:
production_companies.isnull().sum()

name        0
id          0
movie_id    0
dtype: int64

In [6]:
production_companies['name'].str.isspace().value_counts()

False    70561
Name: name, dtype: int64

In [7]:
production_companies.dtypes

name        object
id           int64
movie_id     int64
dtype: object

In [ ]:
production_companies.to_csv('Production_companies.csv',index=False)

# For production countries

In [16]:

tempcont=copy.deepcopy(meta[meta['production_countries'].isnull()==False])

In [17]:
tempcont['production_countries'] = tempcont['production_countries'].apply(ast.literal_eval)

In [ ]:
a=[]
for index,l1 in tempcont.iterrows():

    movid=l1['id']

    for dic in l1['production_countries']:
        if isinstance(dic,dict):
            dic['movie_id']=movid
        else:
            pass
        a.append(dic)
df2=pd.DataFrame(a)

Data cleaning of production countries dataset

In [8]:
df2=pd.read_csv(r'C:\Users\sambangi.bindu\Downloads\Production_countries.csv')

In [9]:
df2.head()

  iso_3166_1                      name  movie_id
0         US  United States of America       862
1         US  United States of America      8844
2         US  United States of America     15602
3         US  United States of America     31357
4         US  United States of America     11862

In [10]:
df2.shape

(49431, 3)

In [11]:
df2.isnull().sum()

iso_3166_1    3
name          0
movie_id      0
dtype: int64

In [12]:
df2[df2['iso_3166_1'].isnull()==True]

      iso_3166_1     name  movie_id
5366         NaN  Namibia     12663
12395        NaN  Namibia      5237
29042        NaN  Namibia     35632

In [13]:
df2[df2['name']=='Namibia']

      iso_3166_1     name  movie_id
5366         NaN  Namibia     12663
12395        NaN  Namibia      5237
29042        NaN  Namibia     35632

In [14]:
df2['name'].str.isspace().value_counts()

False    49431
Name: name, dtype: int64

In [15]:
df2['iso_3166_1'].str.isspace().value_counts()

False    49428
Name: iso_3166_1, dtype: int64

In [16]:
df2.dtypes

iso_3166_1    object
name          object
movie_id       int64
dtype: object

In [17]:
df2[df2.duplicated()]

      iso_3166_1                      name  movie_id
1778          DE                   Germany    105045
4886          JP                     Japan     10991
6626          JP                     Japan     12600
6627          US  United States of America     12600
10999         FR                    France      5511
...          ...                       ...       ...
48821         JP                     Japan     12600
48822         US  United States of America     12600
49239         NO                    Norway    265189
49240         SE                    Sweden    265189
49241         FR                    France    265189

[63 rows x 3 columns]

In [18]:
df2.drop_duplicates()

      iso_3166_1                      name  movie_id
0             US  United States of America       862
1             US  United States of America      8844
2             US  United States of America     15602
3             US  United States of America     31357
4             US  United States of America     11862
...          ...                       ...       ...
49426         IR                      Iran    439050
49427         PH               Philippines    111109
49428         US  United States of America     67758
49429         RU                    Russia    227506
49430         GB            United Kingdom    461257

[49368 rows x 3 columns]

In [19]:
df2.dtypes

iso_3166_1    object
name          object
movie_id       int64
dtype: object

In [ ]:
prodcont.to_csv('Production_countries.csv',index=False)

# for spoken language

In [62]:

tempspl=copy.deepcopy(meta[meta['spoken_languages'].isnull()==False])

In [63]:
tempspl['spoken_languages'] = tempspl['spoken_languages'].apply(ast.literal_eval)

In [64]:
a=[]
for index,l1 in tempspl.iterrows():

    movid=l1['id']

    for dic in l1['spoken_languages']:
        if isinstance(dic,dict):
            dic['movie_id']=movid
        else:
            pass
        a.append(dic)
spl=pd.DataFrame(a)

Data cleaning in spoken language

In [65]:
spl.head()

  iso_639_1      name movie_id
0        en   English      862
1        en   English     8844
2        fr  Français     8844
3        en   English    15602
4        en   English    31357

In [66]:
spl.shape

(53300, 3)

In [67]:
spl.isnull().sum()

iso_639_1    0
name         0
movie_id     0
dtype: int64

In [68]:
spl['name'].str.isspace().value_counts()

False    53300
Name: name, dtype: int64

In [69]:
a=spl[spl['name'].str.isspace()==True]
a

Empty DataFrame
Columns: [iso_639_1, name, movie_id]
Index: []

In [56]:
#a=spl['iso_639_1']=='mn'
#spl.loc[a,['name']]
b=spl.iloc[202,1]
type(b)

str

In [70]:
import numpy as np
for index, row in a.iterrows():
    iso_639_1 = row['iso_639_1']
    original_name = df3.loc[df3['iso_639_1'] == iso_639_1, 'name'].values
    #print(original_name)
    for i in original_name:
        if i!=np.nan:
            a.at[index, 'name'] = i

print(a)

Empty DataFrame
Columns: [iso_639_1, name, movie_id]
Index: []

In [71]:
spl.dtypes

iso_639_1    object
name         object
movie_id     object
dtype: object

In [58]:
spl[spl.duplicated()]

      iso_639_1      name movie_id
1947         de   Deutsch   105045
12247        fr  Français     5511
12467        hi    हिन्दी    23305
16281        en   English    14788
18026        fi     suomi   141971
20156        en   English    22649
21015        fa     فارسی    13209
22245        fi     suomi   141971
27035        en   English    77221
27092        en   English   109962
27340        en   English    84198
28188        en   English   152795
28515        en   English    18440
29521        da     Dansk    25541
30097        fr  Français   110428
31534        en   English    11115
33517        en   English    69234
33518        it  Italiano    69234
36424        en   English    42495
37110        ja       日本語   132641
41148        cs     Český    15028
41149        en   English    15028
41250        en   English     4912
43351        en   English   159849
46429        en   English    99080
47649        en   English   298721
47650        th   ภาษาไทย   298721
47896        en   English    97995
52631        en   English    10991
52638        ja       日本語    12600
53097        fr  Français   265189
53098        no     Norsk   265189
53099        sv   svenska   265189
53100        en   English   265189

In [72]:
spl.drop_duplicates(inplace=True)

In [74]:
spl['movie_id']=spl['movie_id'].astype(int)

In [75]:
spl.dtypes

iso_639_1    object
name         object
movie_id      int32
dtype: object

In [76]:
spl.shape

(53266, 3)

In [77]:
spl.to_csv('spoken_languages.csv', index=False)

# cast datachecking and cleaning

In [30]:
cast=pd.read_csv(r'C:\Users\Utsav.lakhlani\Desktop\Training\Capstone Project 3\datadict\cast.csv')

In [31]:
cast.shape

(562474, 9)

In [32]:
cast[cast.duplicated()]

,cast_id,character,credit_id,gender,id,name,order,profile_path,mov_id
25938,5,Sophie II,52fe4a44c3a36847f81c4655,1,680,Corinna Harfouch,0,/oEXqVyUnBLP1JxRVhpT6B3pIe37.jpg,105045
25939,6,Sophie I,52fe4a44c3a36847f81c4659,1,8790,Meret Becker,1,/104ahKJHYJtZAPZHHJFAoJQkuuv.jpg,105045
25940,7,Konrad,536a992bc3a368124a0085a9,2,11951,August Zirner,2,/51Bgab3YLjCFIbJoFiXrSK95BXI.jpg,105045
25941,8,Barbara,536a993bc3a3681231008608,1,10627,Eva Mattes,3,/9qUzPuHrQ2DV64CycNJMUFq4YvB.jpg,105045
25942,9,Müller,536a9948c3a3681226008272,2,1865,Hark Bohm,4,/ptmIE7lSIiCS6mlXHOz3WgT7D43.jpg,105045
...,...,...,...,...,...,...,...,...,...
560894,6,Brady,543c0752c3a3681990005db1,2,55493,Brady Corbet,5,/cnlvcYJP4UyeKdbCCuTKvFkjWSH.jpg,265189
560895,7,Mats,54af17919251413fe1000473,2,571418,Kristofer Hivju,6,/qlGV5b8FMx2Ut1fgmm6TDc1fHxC.jpg,265189
560896,8,Fanni,54af179fc3a3683fba002768,0,1410873,Fanni Metelius,7,NaN,265189
560897,9,Charlotte,54af17ac925141152c002647,0,1410874,Karin Myrenberg,8,NaN,265189
560898,10,Cleaner,54af17be9251411ef60029dd,0,1410875,Johannes Moustos,9,NaN,265189

In [33]:
cast.drop_duplicates(inplace=True)

In [34]:
cast.shape

(562044, 9)

In [35]:
cast.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 562044 entries, 0 to 562473
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   cast_id       562044 non-null  int64
 1   character     536277 non-null  object
 2   credit_id     562044 non-null  object
 3   gender        562044 non-null  int64
 4   id            562044 non-null  int64
 5   name          562044 non-null  object
 6   order         562044 non-null  int64
 7   profile_path  388366 non-null  object
 8   mov_id        562044 non-null  int64
dtypes: int64(5), object(4)
memory usage: 42.9+ MB

In [36]:
cast['character'].str.isspace().value_counts()

False    536276
True          1
Name: character, dtype: int64

In [37]:
cast[cast['character'].str.isspace()==True]

,cast_id,character,credit_id,gender,id,name,order,profile_path,mov_id
401013,13,,52fe4ddfc3a368484e2023bd,0,1199095,Donna Germain,10,NaN,214447

In [38]:
cast.iloc[400698,1]=cast.iloc[400698,1].replace(' ','')

In [39]:
cast[cast['character'].str.isspace()==True]

Empty DataFrame
Columns: [cast_id, character, credit_id, gender, id, name, order, profile_path, mov_id]
Index: []

In [40]:
cast['credit_id'].str.isspace().value_counts()

False    562044
Name: credit_id, dtype: int64

In [41]:
cast['name'].str.isspace().value_counts()

False    562044
Name: name, dtype: int64

In [42]:
cast['profile_path'].str.isspace().value_counts()

False    388366
Name: profile_path, dtype: int64

# crew datachecking and datacleaning

In [43]:
crew=pd.read_csv(r"C:\Users\Utsav.lakhlani\Desktop\Training\Capstone Project 3\datadict\crew.csv")

In [44]:
crew.shape

(464314, 8)

In [45]:
crew[crew.duplicated()]

,credit_id,department,gender,id,job,name,profile_path,mov_id
23282,52fe4a44c3a36847f81c463f,Directing,1,39298,Director,Margarethe von Trotta,/inHCKINOzP9gby9zCIMm902i1ln.jpg,105045
23283,52fe4a44c3a36847f81c4645,Writing,2,169302,Writer,Peter Schneider,NaN,105045
23284,52fe4a44c3a36847f81c464b,Writing,0,1037349,Writer,Felice Laudadio,NaN,105045
23285,52fe4a44c3a36847f81c4651,Writing,1,39298,Writer,Margarethe von Trotta,/inHCKINOzP9gby9zCIMm902i1ln.jpg,105045
136637,52fe440ac3a36847f807ee01,Camera,2,1657,Director of Photography,Henri Decaë,NaN,5511
...,...,...,...,...,...,...,...,...
463281,54af183d9251411ef60029eb,Editing,0,1154242,Editor,Jacob Secher Schulsinger,NaN,265189
463282,54af18499251414a3d000441,Production,0,1410878,Casting,Katja Wik,NaN,265189
463283,54af185592514169e0002b00,Art,0,1156989,Production Design,Josefin Åsberg,NaN,265189
463284,54af1862c3a3682e400004a7,Art,0,1156989,Art Direction,Josefin Åsberg,NaN,265189
463285,54af186fc3a3684abf001002,Costume & Make-Up,0,1410879,Costume Design,Pia Aleborg,NaN,265189

In [46]:
crew.drop_duplicates(inplace=True)

In [47]:
crew.shape

(463836, 8)

In [48]:
crew.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 463836 entries, 0 to 464313
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   credit_id     463836 non-null  object
 1   department    463836 non-null  object
 2   gender        463836 non-null  int64
 3   id            463836 non-null  int64
 4   job           463836 non-null  object
 5   name          463836 non-null  object
 6   profile_path  95001 non-null   object
 7   mov_id        463836 non-null  int64
dtypes: int64(3), object(5)
memory usage: 31.8+ MB

In [49]:
crew['credit_id'].str.isspace().value_counts()

False    463836
Name: credit_id, dtype: int64

In [50]:
crew['department'].str.isspace().value_counts()

False    463836
Name: department, dtype: int64

In [51]:
crew['job'].str.isspace().value_counts()

False    463836
Name: job, dtype: int64

In [52]:
crew['name'].str.isspace().value_counts()

False    463836
Name: name, dtype: int64

In [53]:
crew['profile_path'].str.isspace().value_counts()

False    95001
Name: profile_path, dtype: int64

# for keywords

In [31]:
df1=pd.read_csv(r'C:\Users\sambangi.bindu\Downloads\Capstone Project 3\Capstone Project 3\Data\keywords.csv')

In [32]:
df1.head()

      id                                           keywords
0    862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1   8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2  15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3  31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4  11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...

In [33]:
df1.shape

(46419, 2)

In [34]:
df1['keywords'] = df1['keywords'].apply(ast.literal_eval)

In [35]:
for index,l1 in df1.iterrows():
    movid=l1['id']
    for dic in l1['keywords']:
        dic['mov_id']=movid

In [36]:
a=[]
for i in df1['keywords']:
    for dic in i:
        a.append(dic)

In [37]:
keywords=pd.DataFrame(a)

In [38]:
keywords

            id          name  mov_id
0          931      jealousy     862
1         4290           toy     862
2         5202           boy     862
3         6054    friendship     862
4         9713       friends     862
...        ...           ...     ...
158675   11800  mockumentary  289923
158676   10703   tragic love  439050
158677    2679        artist  111109
158678   14531          play  111109
158679  215397         pinoy  111109

[158680 rows x 3 columns]

Data cleaning of keywords

In [41]:
keywords.isnull().sum()

id        0
name      0
mov_id    0
dtype: int64

In [42]:
keywords.shape

(158680, 3)

In [43]:
keywords[keywords.duplicated()]

            id                       name  mov_id
10074     7059             anti-communism  105045
10075    33501                  political  105045
10076   187056             woman director  105045
52948       90                      paris    5511
52949     1010                        bar    5511
...        ...                        ...     ...
158372  228304                psychodrama  265189
158373  235729  husband wife relationship  265189
158374  235730        vacation gone wrong  265189
158375  235731                ski holiday  265189
158376  235732             swedish family  265189

[2078 rows x 3 columns]

In [44]:
keywords.drop_duplicates()

            id          name  mov_id
0          931      jealousy     862
1         4290           toy     862
2         5202           boy     862
3         6054    friendship     862
4         9713       friends     862
...        ...           ...     ...
158675   11800  mockumentary  289923
158676   10703   tragic love  439050
158677    2679        artist  111109
158678   14531          play  111109
158679  215397         pinoy  111109

[156602 rows x 3 columns]

In [45]:
keywords['name'].str.isspace().value_counts()

False    158676
True          4
Name: name, dtype: int64

In [46]:
keywords[keywords['name'].str.isspace()==True]

           id name  mov_id
5045    13091        10546
27111   13091        10956
43354   13091          338
130492  13091        65953

In [47]:
keywords.iloc[[5045,27111,43354,130492],1]=keywords.iloc[[5045,27111,43354,130492],1].replace(u'\xa0', u'Â')

In [48]:
keywords.iloc[5045,1]

'Â'

In [49]:
keywords[keywords['name'].str.isspace()==True]

Empty DataFrame
Columns: [id, name, mov_id]
Index: []

In [50]:
keywords.dtypes

id         int64
name      object
mov_id     int64
dtype: object

In [ ]:
keywords.to_csv('keywords.csv',index=False)